using System;

namespace PestelLib.ClientConfig
{
    // нельзя обфусцировать используется как JSON
    [System.Reflection.Obfuscation]
    public class SharedConfig
    {
        [Obsolete]
        /*
         * Это поле раньше использовалось для версии локального debug сохранения
         * на диске; Сейчас в нём уже нет смысла, в будующем будет удалено.
         * Пока оставлено чтобы не разломать нигде компиляцию
         */
        public int SaveVersion = 45;

        [Obsolete]
        /*
         * Использовалось до тех пор, пока не было отдельного версионирования дефов
         * и ШЛ
         */
        public int Version {
            get { return (int)(SharedLogicCrc ^ DefinitionsVersion); }
        }

        /*
         * Обновляется после билда проекта ConcreteSharedLogic
         * с помощью утилиты: PestelLib\Tools\UpdateSharedConfig
         * Это именно CRC от собранной dll ШЛ, инкремент тут плохо подходит т.к. возможна
         * ситуация, в которой два разработчика независимо друг от друга заинкрементили версию,
         * один из них выложил сервер, и проверка версии будет проходить в обоих версиях,
         * хотя в одной из них будут хэш мисматчи
         */
        public uint SharedLogicCrc = 0;

        /*
         * Инкрементится при каждом билде ConcreteSharedLogic
         * Предназначено для того, чтобы клиент после обновления игры не смог зайти в неё с другого устройства
         * старой версией игры
         */
        public uint SharedLogicVersion = 0;
        
        /*
         * Версия дефов храниться отдельно т.к. есть механизм обновления дефов на лету без выкладывания
         * в стор апдейта игры.
         * Инкрементится при каждом импорте.
         * Инкремент тут подходит т.к. таблица синхронизируется в реальном времени гуглом, кроме того так проще
         * обрабатывать обновление дефов.
         */
        public uint DefinitionsVersion = 0;
    }
}
