using System;

namespace PestelLib.ServerCommon.MessageQueue
{
    /// <summary>
    /// Методы паблиша и получения сообщений в абстрактной очереди сообщений.
    /// Предполагается что реализации вешаются на одну очередь таким образом, что
    /// Все участники могут получать каждое сообщение отправленное любым участником.
    /// Отправитель сообщения не должен получать свои сообщения.
    /// </summary>
    public interface IBroadcastQueue
    {
        /// <summary>
        /// Вызывается каждый раз когда в очереди появляется новое сообщение отправленное другим участником.
        /// </summary>
        event Action<byte[]> OnIncomingMessage;
        /// <summary>
        /// Публикует сообщение в очереди так что другие участники его видят.
        /// Каждое сообщение дублируется на общее количество участников -1. 
        /// Если необходимо обработать сообщение однократно IBroadcastQueue не подходит для этого (см. <see cref="IWorkerQueue"/>).
        /// </summary>
        /// <param name="data"></param>
        void SendMessage(byte[] data);
    }
}
